arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/test_adc_30f4011.c
    //serial send timer
    TMR2 = 0 ;      
    PR2=62500;
    //PR2=31250;
    //bit 0 Unimplemented: Read as ?0?
     //Timer1 interrupt set to (inverse of 2500000/8/62500) = 1/200 ms
    //OFFSET by 3036 = 65536-62500 i.e. 0xBDC, so that interrupt is raised at 200 ms
    //Timer1 is used for serial transmit every .2 s
    //transmit interval time is increased in multiple of .2 s by using additional user counter
    //ex. for 10 sec sampling time use counter value 10/0.2 = 50.

    //control system timer
    T1CONbits.TON = 0;
    T1CONbits.TSIDL = 0 ;
    T1CONbits.TGATE = 0;
    T1CONbits.TCKPS = 0 ;
    T1CONbits.TCS = 0;

    TMR1 = 0 ; 
    PR1 = 2500;
    //Timer interrupt set to (inverse of 2500000/8/(65536-3036)) = 200 ms
    //Timer interrupt set to (inverse of 2500000/1/2500) = 1 ms
    //OFFSET by 63036 = 65536-2500 i.e. 0xf63c, so that interrupt is raised at 1 ms
    //Timer2 is used for sampling the data every .4 s
    //sampling time is increased in multiple of .4 s by using additional user counter
    //ex. for 10 sec sampling time use counter value 10/0.4 = 25.
    
    //control system timer
    T3CONbits.TON = 0;
    T3CONbits.TSIDL = 0 ;
    T3CONbits.TGATE = 0;
    T3CONbits.TCKPS = 3 ;
    T3CONbits.TCS = 0;

    TMR3 = 0 ; 
    PR3 = 25000;
    //Timer interrupt set to (inverse of 2500000/1/2500) = 1 ms
    //OFFSET by 63036 = 65536-2500 i.e. 0xf63c, so that interrupt is raised at 1 ms
    //Timer2 is used for sampling the data every .4 s
    //sampling time is increased in multiple of .4 s by using additional user counter
    //ex. for 10 sec sampling time use counter value 10/0.4 = 25.
    
    //control system timer
    T4CONbits.TON = 0;
    T4CONbits.TSIDL = 0 ;
    T4CONbits.TGATE = 0;
    T4CONbits.TCKPS = 0 ;
    T4CONbits.TCS = 0;

    TMR4 = 0 ; 
    PR4 = 2500;
    //Timer interrupt set to (inverse of 2500000/1/250) = 0.1 ms
    //OFFSET by 63036 = 65536-2500 i.e. 0xf63c, so that interrupt is raised at 1 ms
    //Timer2 is used for sampling the data every .4 s
    //sampling time is increased in multiple of .4 s by using additional user counter
    //ex. for 10 sec sampling time use counter value 10/0.4 = 25.
}

void    rs232_init()
{
    //------------UART 1

    //UXMODE: UARTX Mode Register
    //bit 15 UARTEN: UART Enable bit
    //1 = UART is enabled. UART pins are controlled by UART as defined by UEN<1:0> and UTXEN control bits.
    //0 = UART is disabled. UART pins are controlled by corresponding PORT, LAT, and TRIS bits.
    //bit 14 Unimplemented: Read as ?0?
    //bit 13 USIDL: Stop in Idle Mode bit
    //1 = Discontinue operation when device enters Idle mode
    //0 = Continue operation in Idle mode
    //bit 12 Unimplemented: Read as ?0?
    //bit 11 Reserved: Write ?0? to this location
    //bit 10 ALTIO: UART Alternate I/O Selection bit
    //1 = UART communicates using UxATX and UxARX I/O pins
    //0 = UART communicates using UxTX and UxRX I/O pins
    //Note: The alternate UART I/O pins are not available on all devices. See device data sheet for details.
    //bit 9-8 Reserved: Write ?0? to these locations
    //bit 7 WAKE: Enable Wake-up on Start bit Detect During Sleep Mode bit
    //1 = Wake-up enabled
    //0 = Wake-up disabled
    //bit 6 LPBACK: UART Loopback Mode Select bit
    //1 = Enable Loopback mode
    //0 = Loopback mode is disabled
    //bit 5 ABAUD: Auto Baud Enable bit
    //1 = Input to Capture module from UxRX pin
    //0 = Input to Capture module from ICx pin
    //bit 4-3 Unimplemented: Read as ?0?
    //bit 2-1 PDSEL<1:0>: Parity and Data Selection bits
    //11 = 9-bit data, no parity
    //10 = 8-bit data, odd parity
    //01 = 8-bit data, even parity
    //00 = 8-bit data, no parity
    //bit 0 STSEL: Stop Selection bit
    //1 = 2 Stop bits
    //0 = 1 Stop bit

    U1MODEbits.UARTEN = 1 ;
    U1MODEbits.USIDL = 0 ;
    U1MODEbits.ALTIO = 1;   //If ALTIO = 1, then alternate pins UxATX and UxARX are used
    U1MODEbits.PDSEL = 0;   //
    U1MODEbits.STSEL = 0 ;

    //Baud Rate = FCY/16/(UxBRG + 1)
    U1BRG = 7;
    U1STAbits.UTXEN = 0;
    //UXSTA: UARTX Status and Control Register
    //bit 15 UTXISEL: Transmission Interrupt Mode Selection bit
        //1 = Interrupt when a character is transferred to the Transmit Shift register and as result, the transmit buffer becomes empty
        //0 = Interrupt when a character is transferred to the Transmit Shift register (this implies that there is at least
        //one character open in the transmit buffer)
    //bit 14-12 Unimplemented: Read as ?0?
    //bit 11 UTXBRK: Transmit Break bit
        //1 = UxTX pin is driven low, regardless of transmitter state
        //0 = UxTX pin operates normally
    //bit 10 UTXEN: Transmit Enable bit
        //1 = UART transmitter enabled, UxTX pin controlled by UART (if UARTEN = 1)
        //0 = UART transmitter disabled, any pending transmission is aborted and buffer is reset. UxTX pin controlled by PORT.
    //bit 9 UTXBF: Transmit Buffer Full Status bit (Read Only)
        //1 = Transmit buffer is full
        //0 = Transmit buffer is not full, at least one more data word can be written
    //bit 8 TRMT: Transmit Shift Register is Empty bit (Read Only)
        //1 = Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)
        //0 = Transmit shift register is not empty, a transmission is in progress or queued in the transmit buffer
    //bit 7-6 URXISEL<1:0>: Receive Interrupt Mode Selection bit
        //11 =Interrupt flag bit is set when Receive Buffer is full (i.e., has 4 data characters)
        //10 =Interrupt flag bit is set when Receive Buffer is 3/4 full (i.e., has 3 data characters)
        //0x =Interrupt flag bit is set when a character is received
    //bit 5 ADDEN: Address Character Detect (bit 8 of received data = 1)
        //1 = Address Detect mode enabled. If 9-bit mode is not selected, this control bit has no effect.
        //0 = Address Detect mode disabled
    //bit 4 RIDLE: Receiver Idle bit (Read Only)
        //1 = Receiver is Idle
        //0 = Data is being received
    //bit 3 PERR: Parity Error Status bit (Read Only)
        //1 = Parity error has been detected for the current character
        //0 = Parity error has not been detected
    //bit 2 FERR: Framing Error Status bit (Read Only)
        //1 = Framing Error has been detected for the current character
        //0 = Framing Error has not been detected
    //bit 1 OERR: Receive Buffer Overrun Error Status bit (Read/Clear Only)
        //1 = Receive buffer has overflowed
        //0 = Receive buffer has not overflowed
    //bit 0 URXDA: Receive Buffer Data Available bit (Read Only)
        //1 = Receive buffer has data, at least one more character can be read
        //0 = Receive buffer is empty
    //---------------UART2
    //UXMODE: UARTX Mode Register
    //Upper Byte:
    //UARTEN ? USIDL ? reserved ALTIO reserved reserved
    //Lower Byte:
    //WAKE LPBACK ABAUD ? ? PDSEL<1:0> STSEL
    U2MODEbits.UARTEN = 1 ;
    U2MODEbits.USIDL = 0 ;
    U2MODEbits.PDSEL = 0;
    U2MODEbits.STSEL = 0 ;
    U2BRG = 7;
    U2STAbits.UTXEN = 1;
    U2STAbits.URXISEL = 0 ;
    



    //UXSTA: UARTX Status and Control Register
    //Upper Byte:
    //UTXISEL ? ? ? UTXBRK UTXEN UTXBF TRMT
    //URXISEL<1:0> ADDEN RIDLE PERR FERR OERR URXDA



