arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/test_adc_30f4011.c
}

void pwm_init()
{
    //PORTB RB7 RB6 RB5 RB4 RB3 RB2 RB1 RB0
    //RB0/PWM0, RB1/PWM1, RB2/PWM2, RB3/PWM3, RB4/PWM4, RB5/PWM5
    TRISEbits.TRISE0= 0 ;      //set as output  //PWM1 L
    TRISEbits.TRISE1= 0 ;      //set as output  //PWM1 H 
    TRISEbits.TRISE2= 0 ;      //set as output  //PWM2 L
    TRISEbits.TRISE3= 0 ;      //set as output  //PWM2 H
    TRISEbits.TRISE4= 0 ;      //set as output  //PWM3 L
    TRISEbits.TRISE5= 0 ;      //set as output  //PWM3 H

    //PTCON0: PWM TIMER CONTROL REGISTER 0
    


    //bit 15 PTEN: PWM Time Base Timer Enable bit
    //      1 = PWM time base is on
    //      0 = PWM time base is off

    //bit 14 Unimplemented: Read as ?0
    //BIT 13 PTSIDL: PWM Time Base Stop in Idle Mode bit
        //1 = PWM time base halts in CPU Idle mode
        //0 = PWM time base runs in CPU Idle mode
    //bit 12-8 Unimplemented: Read as ?0?

    //bit 7-4 PTOPS<3:0>: PWM Time Base Output Postscale Select bits
    //    0000 = 1:1 Postscale
    //    0001 = 1:2 Postscale
    //    1111 = 1:16 Postscale
    //bit 3-2 PTCKPS<1:0>: PWM Time Base Input Clock Prescale Select bits
    //      00 = PWM time base input clock is FOSC/4 (1:1 prescale)
    //      01 = PWM time base input clock is FOSC/16 (1:4 prescale)
    //      10 = PWM time base input clock is FOSC/64 (1:16 prescale)
    //      11 = PWM time base input clock is FOSC/256 (1:64 prescale)
    //bit 1-0 PTMOD<1:0>: PWM Time Base Mode Select bits
    //      11 = PWM time base operates in a Continuous Up/Down Count mode with interrupts for double PWM updates
    //      10 = PWM time base operates in a Continuous Up/Down Count mode
    //      01 = PWM time base configured for Single-Shot mode
    //      00 = PWM time base operates in a Free-Running mode

    PTCON = 0X01;  //PWM single shot
 PTCONbits.PTCKPS = 1;
   
    //PTMR: PWM Time Base Register
    //bit 15 PTDIR: PWM Time Base Count Direction Status bit (Read Only)
                //1 = PWM time base is counting down
                //0 = PWM time base is counting up
    //bit 14-0 PTMR <14:0>: PWM Timebase Register Count Value

    PTMRbits.PTDIR = 0;

    //PWMCON1: PWM CONTROL REGISTER 1
    //bit 15-12 Unimplemented: Read as ?0?
    //bit 11-8 PMOD4:PMOD1: PWM I/O Pair Mode bits
        //1 = PWM I/O pin pair is in the independent output
        //0 = PWM I/O pin pair is in the complementary output mode
    //bit 7-4 PEN4H-PEN1H: PWMxH I/O Enable bits(1)
        //1 = PWMxH pin is enabled for PWM output
        //0 = PWMxH pin disabled. I/O pin becomes general purpose I/O
    //bit 3-0 PEN4L-PEN1L: PWMxL I/O Enable bits(1)
        //1 = PWMxL pin is enabled for PWM output
        //0 = PWMxL pin disabled. I/O pin becomes general purpose I/O

  
    PWMCON1bits.PEN1H =1 ;      //0 mean general I/O, 1 means PWM
    PWMCON1bits.PEN1L =1 ;      
    PWMCON1bits.PEN2H =1 ;      //0 mean general I/O, 1 means PWM
    PWMCON1bits.PEN2L =1 ;      
    PWMCON1bits.PEN3H =1 ;      //0 mean general I/O, 1 means PWM
    PWMCON1bits.PEN3L =1 ;      
    
    PWMCON1bits.PTMOD3 = 1;     //1 mean L and H are independent
    PWMCON1bits.PTMOD2 = 1;
    PWMCON1bits.PTMOD1 = 1;
    
    OVDCONbits.POVD3L = 0;      //1 mean controlled by PWM pin, 0 mean controlled by POUT
    OVDCONbits.POVD3H = 0;      
    OVDCONbits.POVD2L = 0;
    OVDCONbits.POVD2H = 0;
    OVDCONbits.POVD1L = 0;
    OVDCONbits.POVD1H = 0;
           
    OVDCONbits.POUT1L = 0;
    OVDCONbits.POUT1H = 0;
    OVDCONbits.POUT2L = 0;
    OVDCONbits.POUT2H = 0;
    OVDCONbits.POUT3L = 0;
    OVDCONbits.POUT3H = 0;
   
    //PWMCON2: PWM CONTROL REGISTER 2
    //bit 15-12 Unimplemented: Read as ?0?
    //bit 11-8 SEVOPS<3:0>: PWM Special Event Trigger Output Postscale Select bits
            //1111 = 1:16 Postscale
            //?
            //?
            //0001 = 1:2 Postscale
            //0000 = 1:1 Postscale
    //bit 7-2 Unimplemented: Read as ?0?
    //bit 2 IUE: Immediate Update Enable bit(1)
            //1 = Updates to the active PDC registers are immediate
            //0 = Updates to the active PDC registers are synchronized to the PWM time base
    //bit 1 OSYNC: Output Override Synchronization bit
            //1 = Output overrides via the OVDCON register are synchronized to the PWM time base
            //0 = Output overrides via the OVDCON register occur on next TCY boundary
    //bit 0 UDIS: PWM Update Disable bit
            //1 = Updates from duty cycle and period buffer registers are disabled

    PWMCON2 = 0 ;

    //time base register
    pwm_1kHz

    //DTCON: DEAD-TIME CONTROL REGISTER
    //R/W-0 R/W-0 R/W-0 R/W-0 R/W-0 R/W-0 R/W-0 R/W-0
    //DTPS1 DTPS0 DT5 DT4 DT3 DT2 DT1 DT0
    //bit 7-6 DTPS<1:0>: Dead-Time Unit A Prescale Select bits
    //      11 = Clock source for dead-time unit is FOSC/16
    //      10 = Clock source for dead-time unit is FOSC/8
    //      01 = Clock source for dead-time unit is FOSC/4
    //      00 = Clock source for dead-time unit is FOSC/2
    //bit 5-0 DT<5:0>: Unsigned 6-Bit Dead-Time Value for Dead-Time Unit bits
    DTCON1 = 0 ;

    //OVDCOND: OUTPUT OVERRIDE CONTROL REGISTER
    //R/W-1 R/W-1 R/W-1 R/W-1 R/W-1 R/W-1 R/W-1 R/W-1
    //POVD7(1) POVD6(1) POVD5 POVD4 POVD3 POVD2 POVD1 POVD0
    //bit 7-0 POVD<7:0>: PWM Output Override bits
    //      1 = Output on PWM I/O pin is controlled by the value in the Duty Cycle register and the PWM time base
    //      0 = Output on PWM I/O pin is controlled by the value in the corresponding POUT bit

    //OVDCONS: OUTPUT STATE REGISTER(1,2)
    //R/W-0 R/W-0 R/W-0 R/W-0 R/W-0 R/W-0 R/W-0 R/W-0
    //POUT7(1) POUT6(1) POUT5 POUT4 POUT3 POUT2 POUT1 POUT0
    //bit 7-0 POUT<7:0>: PWM Manual Output bits
    //      1 = Output on PWM I/O pin is active when the corresponding PWM output override bit is cleared
    //      0 = Output on PWM I/O pin is inactive when the corresponding PWM output override bit is cleared

    FLTACON = 0 ;
 
