arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/test_adc_30f4011.c
    SEVTCMP = 0 ;
    
}

void encoder_init()
{
    ADPCFGbits.PCFG3 = 1 ;	//1 for Digital I/Os and 0 for analog input
	ADPCFGbits.PCFG4 = 1 ;	
    ADPCFGbits.PCFG5 = 1 ;	
     
    TRISBbits.TRISB3 = 1 ;  //index
    TRISBbits.TRISB4 = 1 ;  //QEA
    TRISBbits.TRISB5 = 1 ;  //QEB

    //QEICON: QEI Control Register
    //bit 15 CNTERR: Count Error Status Flag bit
    //1 = Position count error has occurred
    //0 = No position count error has occurred
    //bit 14 Unimplemented: Read as ?0?
    //bit 13 QEISIDL: Stop in Idle Mode bit
        //1 = Discontinue module operation when device enters Idle mode
        //0 = Continue module operation in Idle mode
    //bit 12 INDEX: Index Pin State Status bit (Read Only)
        //1 = Index pin is High
        //0 = Index pin is Low
    //bit 11 UPDN: Position Counter Direction Status bit
        //1 = Position Counter Direction is positive (+)
        //0 = Position Counter Direction is negative (-)
    //bit 10-8 QEIM<2:0>: Quadrature Encoder Interface Mode Select bits
        //111 = Quadrature Encoder Interface enabled (x4 mode) with position counter reset by match (MAXCNT)
        //110 = Quadrature Encoder Interface enabled (x4 mode) with Index Pulse reset of position counter
        //101 = Quadrature Encoder Interface enabled (x2 mode) with position counter reset by match (MAXCNT)
        //100 = Quadrature Encoder Interface enabled (x2 mode) with Index Pulse reset of position counter
        //011 = Unused (Module disabled)
        //010 = Unused (Module disabled)
        //001 = Starts 16-bit Timer
        //000 = Quadrature Encoder Interface/Timer off
    //bit 7 SWPAB: Phase A and Phase B Input Swap Select bit
        //1 = Phase A and Phase B inputs swapped
        //0 = Phase A and Phase B inputs not swapped
    //bit 6 PCDOUT: Position Counter Direction State Output Enable bit
        //1 = Position Counter Direction Status Output Enable (QEI logic controls state of I/O pin)
        //0 = Position Counter Direction Status Output Disabled (Normal I/O pin operation)
    //bit 5 TQGATE: Timer Gated Time Accumulation Enable bit
        //1 = Timer gated time accumulation enabled
        //0 = Timer gated time accumulation disabled
    //bit 4-3 TQCKPS<1:0>: Timer Input Clock Prescale Select bits
        //11 = 1:256 prescale value
        //10 = 1:64 prescale value
        //01 = 1:8 prescale value
        //00 = 1:1 prescale value
    //bit 2 POSRES: Position Counter Reset Enable bit
        //1 = Index Pulse resets Position Counter
        //0 = Index Pulse does not reset Position Counter
        //(Bit only applies when QEIM<2:0> = 100 or 110)
    //bit 1 TQCS: Timer Clock Source Select bit
        //1 = External clock from pin QEA (on the rising edge)
        //0 = Internal clock (TCY)
    //bit 0 UDSRC: Position Counter Direction Selection Control bit
        //1 = QEB pin State Defines Position Counter Direction
        //0 = Control/Status bit, UPDN (QEICON<11>), Defines Timer Counter (POSCNT)
  	//QUADRATURE ENCODER INTERFACE CONTROL REGISTER
	QEICONbits.CNTERR = 0 ; 	//0 = No position count error has occurred
	QEICONbits.QEISIDL = 0 ;	//0 = Continue module operation in Idle mode
	QEICONbits.INDX = 0 ;  		//0 = Index pin is Low
	QEICONbits.UPDN = 1 ; 		//0 = Position Counter Direction is negative (-)
	QEICONbits.QEIM = 0x7 ; 	//111 = Quadrature Encoder Interface enabled (x4 mode) with position counter reset by match (MAXCNT)
	QEICONbits.SWPAB = 0 ;  	//0 = Phase A and Phase B inputs not swapped
	QEICONbits.TQGATE = 0 ;  	//0 = Timer gated time accumulation disabled
	QEICONbits.TQCKPS = 0 ; 	//Timer Input Clock Prescale Select bits
	QEICONbits.POSRES = 0 ;		//0 = Index Pulse does not reset Position Counter
	QEICONbits.TQCS = 0 ;		//0 = Internal clock (TCY)
	QEICONbits.UPDN_SRC= 0 ;	//1 = QEB pin State Defines Position Counter Direction
    
    MAXCNT = 2000;
}

void can_init()
{
    TRISFbits.TRISF0 = 1;  //CAN RX input
    TRISFbits.TRISF1 = 0;  //CAN TX output
    
    
    //CiCTRL: CAN Module Control and Status Register
    //bit 15 CANCAP: CAN Message Receive Capture Enable bit
        //1 = Enable CAN capture
        //0 = Disable CAN capture
        //Note: CANCAP is always writable, regardless of CAN module Operating mode.
    //bit 14 Unimplemented: Read as ?0?
    //bit 13 CSIDL: Stop in Idle Mode bit
        //1 = Discontinue CAN module operation when device enters Idle mode
        //0 = Continue CAN module operation in Idle mode
    //bit 12 ABAT: Abort All Pending Transmissions bit
        //1 = Abort pending transmissions in all Transmit Buffers
        //0 = No effect
    //Note: Module will clear this bit when all transmissions aborted.
    //bit 11 CANCKS: CAN Master Clock Select bit
        //1 = FCAN clock is FCY
        //0 = FCAN clock is 4 FCY
    //bit 10-8 REQOP<2:0>: Request Operation Mode bits
        //111 = Set Listen All Messages mode
        //110 = Reserved
        //101 = Reserved
        //100 = Set Configuration mode
        //011 = Set Listen Only mode
        //010 = Set Loopback mode
        //001 = Set Disable mode
        //000 = Set Normal Operation mode
    //bit 7-5 OPMODE<2:0>: Operation Mode bits
        //Note: These bits indicate the current Operating mode of the CAN module. See description for REQOP
    //bits (CiCTRL<10:8>).
    //bit 4 Unimplemented: Read as ?0?
    //bit 3-1 ICODE<2:0>: Interrupt Flag Code bits
        //111 = Wake-up interrupt
        //110 = RXB0 interrupt
        //101 = RXB1 interrupt
        //100 = TXB0 interrupt
        //011 = TXB1 interrupt
        //010 = TXB2 interrupt
        //001 = Error interrupt
        //000 = No interrupt
    //bit 0 Unimplemented: Read as ?0?
    C1CTRLbits.REQOP = 4;
    while(C1CTRLbits.OPMODE !=4);
    
    C1CTRLbits.CANCAP = 1 ;
    C1CTRLbits.CANCKS = 0 ;
    //CiTXnCON: Transmit Buffer Status and Control Register
    C1TX0CON = 0x00000;

    C1TX0SID = 0x00f0;
    C1TX0EID = 0;
    C1TX0DLC = 0x0008;
    
