arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/test_adc_30f4011.c
    }
}

void __attribute__((__interrupt__, __auto_psv__)) _T1Interrupt(void)
{
    /* The focus mechanism slides on a precise THK Ball Screw arrangement which 
     * travels 5 mm/revolution. 
     * The mechanism is coupled to a Superior Electric KM062 bipolar stepper motor 
     * using a timing belt and pulleys offering a reduction of 1:2. 
     * It has an incremental shaft encoder for position measurement and for initial 
     * referencing a PCA-116 series LVDT is used. 
     * The motor and the on-shaft encoder undergo four full rotations generating 
     * four index pulses in the range ±5 mm. 
     * At 0.9 degree per half step the housing can be positioned with a resolution of 6.25 µm.
     * 400 1/2 steps per one motor rotation
     * 800 1/2 steps per one shaft rotation
     * 800 1/2 steps per 5mm travel
     * Total range -/+ 5 mm. or 1600 steps or 4 rotations.
     * Resolution 5/800 mm = 6.25 um
     */
    static long i; 
    
    IFS0bits.T1IF = 0;
    //timer_1_counter++;
   
    
    
  //  ADCON1bits.SAMP = 1;
   // while(!ADCON1bits.DONE);
    //adc_2_value = ADCBUF0;
    if(focus.move_command&(focus.ok_to_move_pos||focus.ok_to_move_neg))
    {
        if(focus.speed == 0)
            PTPER = 0 ; 
        else 
            PTPER = 1.0*2500000/focus.speed - 1;
        
        PDC1 = PTPER ; 
        focus.move_command = 0;
        focus.moving = 1 ; 
        
        focus.position_error = focus.command - focus.position;

        if(focus.position_error>=0)
        {    
            focus.direction = 1;
            while((focus.position!=focus.command))
            {
                if(focus.stop_command || focus.move_command)
                {
                    break;
                }
                                
                if(focus.position >= focus.soft_plim)
                {
                    focus.plim = 1; 
                    focus.sw_plim = 1;
                    
                    focus.command = focus.position;
                    focus.position_error = 0;
                    break;
                }
                
                step_cw
                focus.position++;   
                focus.position_error = focus.command - focus.position ; 
                
            }

        }
        else
        {
            focus.direction = 0;
            while((focus.position!=focus.command))
            {
                if(focus.stop_command || focus.move_command)
                {
                    break;                    
                }
                
                if(focus.position <= focus.soft_nlim)
                {
                    focus.nlim = 1; 
                    focus.sw_nlim = 1;
                    
                    focus.command = focus.position;
                    focus.position_error = 0;
                            
                    break;
                }
                
                step_ccw
                focus.position--;
                focus.position_error = focus.command - focus.position ; 
                

            }
        }
    
        
        focus.moving = 0 ; 
        focus.move_done = 1;
      
    }
    
    C1TX0DLCbits.DLC = 8;
    C1TX0B1 = 1 ;
    C1TX0B2 = 2 ;
    C1TX0B3 = 3 ;
    C1TX0B4 = 4 ;
    C1TX0CONbits.TXREQ =1;
 
}


void __attribute__((__interrupt__, __auto_psv__)) _T2Interrupt(void)
{

    IFS0bits.T2IF = 0;
    
    int_count_t2++;
        if(int_count_t2>99999)
            int_count_t2 = 0;
        
    timer_2_counter++;
   
    
    
    if(timer_2_counter == 2)    //200 ms timer x 5 = 1000 ms
    {
        //module
        tx_1_data[0] = 'B';
        tx_1_data[1] = focus.device_address/10+48;
        tx_1_data[2] = focus.device_address%10+48;
        tx_1_data[3] = ' ';
        
        focus.abs_position = abs(focus.position) ;
        focus.abs_position_error = abs(focus.position_error);
        
        if(focus.position<0)
            tx_1_data[4] = '-';
        else 
            tx_1_data[4] = '+';
        
        
        tx_1_data[5] =  (focus.abs_position)/10000%10+48;
        tx_1_data[6] =  (focus.abs_position)/1000%10+48;
        tx_1_data[7] =  (focus.abs_position)/100%10+48;
        tx_1_data[8] =  (focus.abs_position)/10%10+48;
        tx_1_data[9] =  (focus.abs_position)%10+48;
        tx_1_data[10] =  ' ';
        tx_1_data[11] =  (focus.abs_position_error)/10000%10+48;
        tx_1_data[12] =  (focus.abs_position_error)/1000%10+48;
        tx_1_data[13] =  (focus.abs_position_error)/100%10+48;
        tx_1_data[14] =  (focus.abs_position_error)/10%10+48;
        tx_1_data[15] =  (focus.abs_position_error)%10+48;
        tx_1_data[16] =  ' '; 
        tx_1_data[17] =  (POSCNT)/10000%10+48;
        tx_1_data[18] =  (POSCNT)/1000%10+48;
        tx_1_data[19] =  (POSCNT)/100%10+48;
        tx_1_data[20] =  (POSCNT)/10%10+48;
        tx_1_data[21] =  (POSCNT)%10+48;
        tx_1_data[22] =  ' ';
        tx_1_data[23] =  (adc_2_value)/1000%10+48;
        tx_1_data[24] =  (adc_2_value)/100%10+48;
        tx_1_data[25] =  (adc_2_value)/10%10+48;
        tx_1_data[26] =  (adc_2_value)%10+48;
        if(focus.soft_nlim<0)
            tx_1_data[27] =  '-';
        else 
            tx_1_data[27] =  '+';
        tx_1_data[28] =  adc_1_value/10000%10+48;//abs(focus.soft_nlim)/10000%10+48;
        tx_1_data[29] =  adc_1_value/1000%10+48;//abs(focus.soft_nlim)/1000%10+48;
        tx_1_data[30] =  adc_1_value/100%10+48;//abs(focus.soft_nlim)/100%10+48;
        tx_1_data[31] =  adc_1_value/10%10+48;//abs(focus.soft_nlim)/10%10+48;
        tx_1_data[32] =  adc_1_value%10+48;//abs(focus.soft_nlim)%10+48;
        tx_1_data[33] =  ' ';
         if(focus.soft_plim<0)
            tx_1_data[34] =  '-';
        else 
            tx_1_data[34] =  '+';
        tx_1_data[35] =  abs(focus.soft_plim)/10000%10+48;
        tx_1_data[36] =  abs(focus.soft_plim)/1000%10+48;
        tx_1_data[37] =  abs(focus.soft_plim)/100%10+48;
        tx_1_data[38] =  abs(focus.soft_plim)/10%10+48;
        tx_1_data[39] =  abs(focus.soft_plim)%10+48;
        tx_1_data[40] =  ' ';
        
        
        tx_1_data[41] =  focus.status3>>8;
        tx_1_data[42] =  focus.status3;
        tx_1_data[43] =  focus.status3>>8;
        tx_1_data[44] =  focus.status3;
        tx_1_data[45] =  focus.status3>>8;
        tx_1_data[46] =  focus.status3;
        tx_1_data[47] =  ' ';
        tx_1_data[48] =  '\n';
        tx_1_data[49] =  '\r';


        tx_1_count  =  50;
        tx_2_count  =  50;


