arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/test_adc_30f4011.c
                                    focus.stop_command = 0; 
                                    focus.move_command = 1;
                                    focus.speed = focus.speed_preset;
                                }
                                
                                else 
                                {
                                    focus.invalid_req_position = 1; 
                                    focus.stop_command = 0; 
                                    
                                    return;
                                }
                                    
                                break;
                            }

            case STATUS:    {

                                break;  
                            }
            case PARAMETER:
                            {
                                if(rx_1_data[3]== 'W')
                                {
                                    if(rx_1_data[4]== 'O')
                                    {
                                        if((rx_1_data[5]=='-'||rx_1_data[5]=='+')&(rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.offset = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        
                                            if(rx_1_data[5]== '-')
                                                focus.offset = -1*focus.offset;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                
                                    if(rx_1_data[4]== 'P')      //limit sw posi
                                    {
                                        if((rx_1_data[5]=='-'||rx_1_data[5]=='+')&(rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.plim_pos = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                         
                                            if(rx_1_data[5]== '-')
                                                focus.plim_pos = -1*focus.plim_pos;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
                                    if(rx_1_data[4]== 'N')      //limit sw posi
                                    {
                                        if((rx_1_data[5]=='-'||rx_1_data[5]=='+')&(rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.nlim_pos = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                            
                                            if(rx_1_data[5]== '-')
                                                focus.nlim_pos = -1*focus.nlim_pos;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                        
                                    }
                                    
                                    if(rx_1_data[4]== 'p')      //soft limit
                                    {
                                        if((rx_1_data[5]=='-'||rx_1_data[5]=='+')&(rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.soft_plim = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        
                                            if(rx_1_data[5]== '-')
                                                focus.soft_plim = -1*focus.soft_plim;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
                                    if(rx_1_data[4]== 'n')      //soft limit
                                    {
                                        if((rx_1_data[5]=='-'||rx_1_data[5]=='+')&(rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.soft_nlim = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        
                                            if(rx_1_data[5]== '-')
                                                focus.soft_nlim = -1*focus.soft_nlim;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
