arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/test_adc_30f4011.c
                                    if(rx_1_data[4]== 'S')  //steps per rotation
                                    {
                                        if((rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.steps_per_motor_rot = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
                                    if(rx_1_data[4]== 'R')  //reduction
                                    {
                                        if((rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.reduction = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
                                    if(rx_1_data[4]== 'M')  //steps per op motion
                                    {
                                        if((rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.steps_per_output_motion = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
                                    if(rx_1_data[4]== 'V') //preset speed
                                    {
                                        if((rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.speed_preset = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
                                    if(rx_1_data[4]== 'I') //Device address 
                                    {
                                        if((rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9')&(rx_1_data[9]>= '0'&& rx_1_data[9]<= '9')&(rx_1_data[10]>= '0'&& rx_1_data[10]<= '9'))
                                        {
                                            focus.device_address = (rx_1_data[6]-48)*10000+(rx_1_data[7]-48)*1000+(rx_1_data[8]-48)*100+(rx_1_data[9]-48)*10+rx_1_data[10]-48;
                                        }
                                        else 
                                        {
                                            focus.invalid_req_position = 1; 
                                            return;
                                        }
                                    }
                                    
                                }
                                
                                if(rx_1_data[3]== 'S')
                                {
                                    if(rx_1_data[4]== 'E') //Enable drive
                                    {
                                        NOT_ENABLE_OUT = 0;
                                        focus.enable = 1;
                                    }
                                    if(rx_1_data[4]== 'D') //Disable drive
                                    {
                                        NOT_ENABLE_OUT = 1;
                                        focus.enable = 0;
                                    }
                                    if(rx_1_data[4]== 'M')  //emergency ON
                                    {
                                        focus.emergency = 1;
                                    }
                                    if(rx_1_data[4]== 'C')  //emergency clear
                                    {
                                        focus.emergency = 0; 
                                    }
                                    
